//========================================
// 
// エフェクト3D基底クラスの処理
// Author:RIKU NISHIMURA
// 
//========================================
#include "../../../RNlib.h"

//================================================================================
//----------|---------------------------------------------------------------------
//==========| [公開]エフェクト3D基底クラスのメンバ関数
//----------|---------------------------------------------------------------------
//================================================================================

//========================================
// コンストラクタ
//========================================
CEffect3D_Base::CEffect3D_Base(const UShort& priority, const Pos3D& pos, const Rot3D& rot, const short& life, const CEase::TYPE& easeType, const CDrawState::ALPHA_BLEND_MODE& alphaBlendType) {

	// リストに追加
	RNSystem::GetEffet3DMgr().AddList(this);

	m_priority       = priority;
	m_pos            = pos;
	m_rot            = rot;
	m_life           = 
	m_lifeMax        = life;
	m_easeType       = easeType;
	m_alphaBlendMode = alphaBlendType;
}

//========================================
// デストラクタ
//========================================
CEffect3D_Base::~CEffect3D_Base() {

	// リストから削除
	RNSystem::GetEffet3DMgr().SubList(this);
}

//================================================================================
//----------|---------------------------------------------------------------------
//==========| [内公開]エフェクト3D基底クラスのメンバ関数
//----------|---------------------------------------------------------------------
//================================================================================

//========================================
// ライフカウント処理
//========================================
float CEffect3D_Base::CountLife(void) {

	if (m_life != NONEDATA) {
		if (--m_life <= 0) {
			Delete();
		}

		return CEase::Easing(m_easeType, m_lifeMax - m_life, m_lifeMax);
	}

	return 0.0f;
}