//========================================
// 
// エフェクト3D(モデル)の処理
// Author:RIKU NISHIMURA
// 
//========================================
#include "../../../RNlib.h"

//================================================================================
//----------|---------------------------------------------------------------------
//==========| [公開]エフェクト3D(モデル)クラスのメンバ関数
//----------|---------------------------------------------------------------------
//================================================================================

//========================================
// コンストラクタ
//========================================
CEffect3D_Model::CEffect3D_Model(const short& priority, const Pos3D& pos, const Rot3D& rot, const short& life, const CEase::TYPE& easeType, const CDrawState::ALPHA_BLEND_MODE& alphaBlendType) : CEffect3D_Base(priority, pos, rot, life, easeType, alphaBlendType) {

}

//========================================
// デストラクタ
//========================================
CEffect3D_Model::~CEffect3D_Model() {

}

//========================================
// 更新処理
//========================================
void CEffect3D_Model::Update(void) {

	// 割合を取得
	const float rate = CountLife();
	const float rateOpp = 1.0f - rate;
}