//========================================
// 
// 基底用登録情報クラスの定義
// Author:RIKU NISHIMURA
// 
//========================================
#include "../../RNlib.h"

//================================================================================
//----------|---------------------------------------------------------------------
//==========| 基底用描画情報クラスのメンバ関数
//----------|---------------------------------------------------------------------
//================================================================================

//========================================
// コンストラクタ
//========================================
CRegistInfoBase::CRegistInfoBase() {

	m_priority   = 0;
	m_clippingID = NONEDATA;
}

//========================================
// デストラクタ
//========================================
CRegistInfoBase::~CRegistInfoBase() {

}

//========================================
// 描画情報に代入
//========================================
void CRegistInfoBase::AssignToDrawInfo(CDrawInfoBase& drawInfo, const CDrawInfoBase::TYPE& type) {

	drawInfo.m_type       = type;
	drawInfo.m_priority   = m_priority;
	drawInfo.m_clippingID = m_clippingID;
}