//========================================
// 
// 蝙蝠の処理
// Author:KOMURO HIROMU
// 
//========================================
#include "bat.h"
#include "../../main.h"

//================================================================================
//----------|---------------------------------------------------------------------
//==========| CBatクラスのメンバ関数
//----------|---------------------------------------------------------------------
//================================================================================

//========================================
// コンストラクタ
//========================================
CBat::CBat(void) {
	Manager::StageObjectMgr()->AddList(this);

	m_type = TYPE::BACKGROUND;	// 種類の設定
								// 大きさの設定
	m_width = SIZE_OF_1_SQUARE * 5;
	m_height = SIZE_OF_1_SQUARE * 5;

	// 各情報の初期化
	m_pos = INITD3DXVECTOR3;
	m_rot = INITD3DXVECTOR3;
}

//========================================
// デストラクタ
//========================================
CBat::~CBat(void) {

}

//========================================
// 初期化処理
// Author:KOMURO HIROMU
//========================================
void CBat::Init(void) {
	ModelIdx = RNLib::Model().Load();

}

//========================================
// 終了処理
// Author:KOMURO HIROMU
//========================================
void CBat::Uninit(void) {

}

//========================================
// 更新処理
// Author:KOMURO HIROMU
//========================================
void CBat::Update(void) {

	RNLib::Model().Put(PRIORITY_OBJECT, ModelIdx, m_pos, m_rot, false)

}

//========================================
// 描画処理
// Author:KOMURO HIROMU
//========================================
void CPlanet::Draw(void) {


}