//========================================
// 
// デフォルトデータの処理
// Author:RIKU NISHIMURA
// 
//========================================
#include "../RNLib.h"

//================================================================================
//----------|---------------------------------------------------------------------
//==========| [公開]デフォルトデータクラスのメンバ関数
//----------|---------------------------------------------------------------------
//================================================================================

//****************************************
// 定数定義
//****************************************
const char* CDefaultData::MODEL_PATH[(int)MODEL::MAX] = {
	"data\\_RNData\\Model\\Prufen\\Head.x",
};

//========================================
// コンストラクタ
//========================================
CDefaultData::CDefaultData(void) {

	for (int cntModel = 0; cntModel < (int)MODEL::MAX; cntModel++) {
		m_modelIdxes[cntModel] = NONEDATA;
	}
}

//========================================
// デストラクタ
//========================================
CDefaultData::~CDefaultData(void) {

}

//========================================
// 初期化処理
//========================================
void CDefaultData::Init(void) {

	// モデル読み込み
	for (int cntModel = 0; cntModel < (int)MODEL::MAX; cntModel++) {
		m_modelIdxes[cntModel] = RNLib::Model().Load(MODEL_PATH[cntModel]);
	}
}
